from django import forms
from django.contrib.auth.models import User  # นำเข้าโมเดล User ที่มีอยู่ใน Django มาใช้งานใน forms.py เพื่อสร้างฟอร์มสำหรับการลงทะเบียนผู้ใช้ใหม่ โดยไม่ต้องสร้างฟิลด์สำหรับชื่อผู้ใช้ รหัสผ่าน และอีเมลด้วยตัวเอง เพราะโมเดล User มีฟิลด์เหล่านี้อยู่แล้ว และเราสามารถใช้ความสัมพันธ์ OneToOneField เพื่อเชื่อมโยงโมเดล Profile กับโมเดล User ได้อย่างสะดวกและมีประสิทธิภาพ
from django.contrib.auth.forms import UserCreationForm  # นำเข้า UserCreationForm จาก django.contrib.auth.forms เพื่อใช้เป็นฟอร์มสำหรับการลงทะเบียนผู้ใช้ใหม่ โดยฟอร์มนี้มีฟิลด์สำหรับชื่อผู้ใช้ รหัสผ่าน และยืนยันรหัสผ่านมาให้แล้ว ทำให้เราสามารถสร้างฟอร์มลงทะเบียนได้อย่างง่ายดายและรวดเร็ว โดยไม่ต้องเขียนโค้ดซ้ำซ้อนในการสร้างฟิลด์เหล่านี้ด้วยตัวเอง

class UserRegisterForm(UserCreationForm):
    email = forms.EmailField()  # เพิ่มฟิลด์อีเมลในฟอร์มลงทะเบียน โดยใช้ EmailField ซึ่งจะช่วยให้เราสามารถตรวจสอบความถูกต้องของอีเมลที่ผู้ใช้กรอกเข้ามาได้อย่างง่ายดาย และยังช่วยให้เราสามารถส่งอีเมลยืนยันการลงทะเบียนหรือการรีเซ็ตรหัสผ่านได้ในอนาคตด้วย

    class Meta:
        model = User  # กำหนดโมเดลที่ฟอร์มนี้จะทำงานด้วย ซึ่งในที่นี้คือโมเดล User ที่มีอยู่ใน Django อยู่แล้ว
        fields = ['username', 'email']  # กำหนดฟิลด์ที่จะแสดงในฟอร์มลงทะเบียน โดยสามารถเลือกแสดงฟิลด์ที่ต้องการได้ตามต้องการ ในที่นี้เราเลือกแสดงฟิลด์สำหรับชื่อผู้ใช้ อีเมล รหัสผ่าน และยืนยันรหัสผ่าน เพื่อให้ผู้ใช้สามารถกรอกข้อมูลเหล่านี้ได้อย่างครบถ้วนและถูกต้องในการลงทะเบียนผู้ใช้ใหม่  
        labels = {
            'username': 'ชื่อผู้ใช้งาน',  # กำหนดป้ายชื่อ (label) สำหรับฟิลด์ username ในฟอร์มลงทะเบียน โดยใช้ภาษาไทยเพื่อให้ผู้ใช้เข้าใจได้ง่ายขึ้น
            'email': 'อีเมล',  # กำหนดป้ายชื่อ (label) สำหรับฟิลด์ email ในฟอร์มลงทะเบียน โดยใช้ภาษาไทยเพื่อให้ผู้ใช้เข้าใจได้ง่ายขึ้น
        }   